# NumberOfStories Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
Stairs..::..NumberOfStories Property
Stairs Class See Also
---
The number of stories of a multi-story stair, or 1 for a single-story stair.
**Namespace:** Autodesk.Revit.DB.Architecture**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public int NumberOfStories { get; }
```

Visual Basic
---
```text
Public ReadOnly Property NumberOfStories As Integer
	Get
```

Visual C++
---
```text
public:
property int NumberOfStories {
	int get ();
}
```

# See Also
Stairs Class
Autodesk.Revit.DB.Architecture Namespace